out/person/martin-löf/martin-löf.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>person/martin-löf/martin-löf.org</title>
</head>
<body>
<pre>#+title: Martin-Löf

* (1972) infinite terms and a system of natural deduction

* (1975) about models for intuitionistic type theories and the notion of definitional equality

*** 1 models

* (1975) syntax and semantics of the language of primitive recursive functions

* (1976) a note to michael dummett

* (1983) notes on the domain interpretation of type theory

* (1987) the logic of judgements

  - [the hand writing is too hard to read]

* (1987) truth of a proposition, evidence of a judgment, validity of a proof

* (1990) mathematics of infinity

* (1990) a path from logic to metaphysics

* (1992) substitution calculus (notes from a lecture given in göteborg)

* (1994) analytic and synthetic judgements in type theory

  - 指出 brouwer 受 kant 影響

* (1998) truth and knowability: on the principles c and k of michael dummett

* &gt;&lt; (2008) hilbert brouwer controversy resolved?

* (2009) one hundred years of zermelo&apos;s axiom of choice. what was the problem with it?

* (2013) verificationism then and now

* (2014) making sense of normalization by evaluation

* others

*** [note] predicate vs type-constructor

***** observation 1

      - &apos;even?&apos; can be defined as a predicate on type &lt;nat&gt;
        (: even? (-&gt; &lt;nat&gt; -- &lt;bool&gt;))

      - while it can also be defined as a type-constructor
        #+begin_src jojo
        (+type &lt;even&gt; (-&gt; (. .num &lt;nat&gt;) -- &lt;&lt;type&gt;&gt;)
          zero (-&gt; -- zero &lt;even&gt;)
          plus-two (-&gt; (. .pre :m &lt;even&gt;)
                    -- :m succ succ &lt;even&gt;))

        (proof (-&gt; -- zero succ succ &lt;even&gt;)
          zero plus-two)
        #+end_src

      - &lt;nat&gt; is so simple,
        we do not really have to define &lt;even&gt;
        we can simply write &apos;even?&apos;

      - we can view &apos;even?&apos; as generating a proof for each {:n &lt;even&gt;}
        or even better, it can generate a negation of {:n &lt;even&gt;}

        - although in normal implementation of &apos;even?&apos;
          it output a &lt;bool&gt; instead of a proof.

***** observation 2

      - &apos;add-associative&apos; is defined as
        #+begin_src jojo
        (+proof add-associative
          (-&gt; (: :x :y :z &lt;nat&gt;)
           -- :x :y add :z add
              :x :y :z add add &lt;eq&gt;)
          (match :z
            zero refl
            succ [:x :y :z.pre recur {succ} eq-apply]))
        #+end_src

      - it can be viewed as equivalence between two functions
        {2-1-sawp add add} == {add add}

      - while &apos;add-commutative&apos; can be viewed as
        {sawp add} == {add}

      - the space of functions like (-&gt; &lt;nat&gt; &lt;nat&gt; -- &lt;nat&gt;)
        is so complicated,

        we do not have a basic predicate for equivalence
        between functions in such space.

        we have to prove each instance of equivalence.
        for example, &apos;add-commutative&apos; proves {swap add} == {add}

***** observation 3

      - computation can happen during type-checking.
        applying a predicate is a computation.

        is it meaningful to use predicate in type?

***** &gt;&lt; LTEQ

      - just like EVEN

***** &gt;&lt; LT

      - x -
        基本等词 与 unification 不同
        基本等词 是唯一允许的 predicate
        基本等词 可以用来做否定

      - k -
        如果基本等词是 predicate
        那么为何不允许别的 predicate 呢?

      - x -
        在 coq 中找例子

*** programming in martin lof&apos;s type theory

*** intuitionistic type theory -- from plato.stanford.edu

***** info

      - at <a href="https://plato.stanford.edu/entries/type-theory-intuitionistic/">https://plato.stanford.edu/entries/type-theory-intuitionistic/</a>

      - by Peter Dybjer
        and Erik Palmgren

***** intro

      - an overview of the most important aspects of intuitionistic type theory
        a kind of &quot;extended abstract&quot;
        It is meant for a reader who is already somewhat familiar with the theory

      - Section 2 on the other hand,
        is meant for a reader who is new to intuitionistic type theory
        but familiar with traditional logic,
        including propositional and predicate logic,
        arithmetic, and set theory.
        Here we informally introduce several aspects
        which distinguishes intuitionistic type theory
        from these traditional theories.

      - In Section 3 we present a basic version of the theory,
        close to Martin-Löf’s first published version from 1972.
        The reader who was intrigued by the informality of Section 2
        will now see in detail how the theory is built up.

      - Section 4 then presents a number of important extensions of the basic theory.
        In particular, it emphasizes the central role of
        inductive (and inductive-recursive) definitions.

      - Section 5 introduces the underlying philosophical ideas
        including the theory of meaning developed by Martin-Löf.

      - While Section 5 is about philosophy and foundations,
        Section 6 gives an overview of mathematical models of the theory.

      - In Section 7 finally,
        we describe several important variations
        of the core Martin-Löf &quot;intensional&quot; theory described in Section 3 and 4.

***** 1. Overview

      - not only about how should we play [by constructive proof]
        but also about what should we play with [constructive mathematical objects]
        thus it is more than math
        it is philosophy

***** 2. Propositions as Types
