out/person/martin-löf/martin-löf.org.html

******* 2.1 Intuitionistic Type Theory: a New Way of Looking at Logic?

        - Intuitionistic type theory
          offers a new way of analyzing logic,
          mainly through its introduction of
          *explicit proof objects*.

********* 2.1.1 A Type Theory

          - This provides
            a direct computational interpretation of logic,
            since there are computation rules for proof objects.

********* 2.1.2 An intuitionstic logic with proof-objects

          - example :
            #+begin_src jojo
            (-&gt; (: :m :n &lt;nat&gt;) :m zero &lt;gt&gt;
             -- (: :q :r &lt;nat&gt;) :m :q mul :r add :n &lt;eq&gt;)

            (-&gt; (: :m :n N) :m zero GT
             -- (: :q :r N) :m :q mul :r add :n I)

            (note
              where GT is defined as type alias :
              (: :x :y GT)
              (: :y :z add inc :x I))
            #+end_src

********* 2.1.3 An extension of first-order predicate logic

          - x -
            in predicate logic (first-order or higher)
            the domain of predicate can be viewed as set.

            [suppose we use set theory
            to specify the denotational semantics
            of the logic system.]

            cartesian product will be the main way
            of constructing new sets.
            (new domain of predicate)

            function is defined as special relation (predicate)
            equivalence is defined special relation
            - which is wrong, because
              &quot;meaningful distinctions deserve to be maintained.&quot;

          - difference from predicate logic :
            in intuitionistic type theory
            we can introduce unspecified family symbols.
            [type-constructor]

********* 2.1.4 A logic with several forms of judgment

          - the type system of intuitionistic type theory is very expressive.
            1. well-formedness of a type
            2. well-typedness of a term with respect to a type
            3. equality judgments for types and terms

          - while predicate logic focus on the sole judgment
            expressing the truth of a proposition.

********* 2.1.5 Semantics

          - Semantics of predicate logic
            can be established by Tarski&apos;s model theory.

          - In intuitionistic type theory,
            Semantics is BHK-interpretation of logic.

          - Tarski semantics is usually presented meta-mathematically,
            and assumes set theory.

          - Martin-Löf’s meaning theory of intuitionistic type theory
            should be understood directly and &quot;pre-mathematically&quot;,
            that is, without assuming a meta-language such as set theory.

********* 2.1.6 A functional programming language

          - different from normal functional programming language :
            1. it has dependent types
            2. all typable programs terminate

******* 2.2 The Curry-Howard Correspondence

******* 2.3 Sets of Proof-Objects

        - x -
          proof theory.
          program is record of deduction steps i.e. proof.

******* 2.4 Dependent Types

******* 2.4 Propositions as Types in Intuitionistic Type Theory

        - With propositions as types,
          predicates become dependent types.
          For example, the predicate Prime(x)
          becomes the type of proofs that x is prime.

        - example :
          #+begin_src jojo
          (-&gt; (: :m N) -- (: :n N) :m :n LT, :n Prime)
          #+end_src

        - x -
          in my sequent calculus :
          #+begin_src jojo
          [∀ m : N, ∃ n : N ...]
          (-&gt; (: :m N)
           -- (: :n N) ...)

          [∃ n : N ...]
          (-&gt;
           -- (: :n N) ...)

          [∀ m : N, ∃ n : N, ∀ p : N ...]
          (-&gt; (: :m N)
           -- (: :n N)
              (-&gt; (: :p N)
               -- ...))

          [∀ m : N, ∃ n : N, ∀ p : N, ∃ q : N ...]
          (-&gt; (: :m N)
           -- (: :n N)
              (-&gt; (: :p N)
               -- (: :q N) ...))
          #+end_src

***** 3. Basic Intuitionistic Type Theory

******* 3.1 Judgments

        - In Martin-Löf (1996)
          a general philosophy of logic is presented
          where the traditional notion of judgment
          is expanded and given a central position.
          A judgment is no longer just an affirmation
          or denial of a proposition,
          but a general act of knowledge.

******* 3.2 Judgment Forms

        - four forms of judgment :
          1. A : type   -- A is a well-formed type
          2. a : A      -- a has type A
          3. A = A&apos;     -- A and A&apos; are equal types
          4. a = a&apos; : A -- a and a&apos; are equal elements of type A

******* 3.3 Inference Rules

        - rules about type formers [type-constructors]
          are classified as :
          1. formation
          2. introduction
          3. elimination
          4. equality

******* 3.4 Intuitionistic Predicate Logic

        - take Π as an example :

          - formation

          - introduction

          - elimination
            #+begin_src jojo
            (: f (-&gt; (: x A) -- B)) (: a A)
            ----------------------------------------
            (: a f B [x := a])
            #+end_src

            - x -
              in (: f (-&gt; (: x A) -- B))
              B is not a type but only a syntactic form
              x might occurs in B
              this is why those rules are not good

          - equality

******* 3.5 Natural Numbers
******* 3.6 The Universe of Small Types
******* 3.7 Propositional Identity
******* 3.8 The Axiom of Choice is a Theorem

***** 4. Extensions

******* 4.1 The Logical Framework
******* 4.2 A General Identity Type Former
******* 4.3 Well-Founded Trees
******* 4.4 Iterative Sets and CZF
******* 4.5 Inductive Definitions
******* 4.6 Inductive-Recursive Definitions

***** 5. Meaning Explanations

******* 5.1 Computation to Canonical Form
******* 5.2 The Meaning of Categorical Judgments
******* 5.3 The Meaning of Hypothetical Judgments

***** 6. Mathematical Models

******* 6.1 Categorical Models
******* 6.2 Set-Theoretic Model
******* 6.3 Realizability Models
******* 6.4 Model of Normal Forms and Type-Checking

***** 7. Variants of the Theory

******* 7.1 Extensional Type Theory
******* 7.2 Univalent Foundations and Homotopy Type Theory
******* 7.3 Partial and Non-Standard Type Theory
******* 7.4 Impredicative Type Theory
******* 7.5 Proof Assistants

*** intuitionistic type theory -- from wikipedia

***** MLTT71

      - was the first of type theories created by Per Martin-Löf.
        It appeared in a preprint in 1971.
        It had one universe
        but this universe had a name in itself,
        i.e. it was a type theory with,
        as it is called today, &quot;Type in Type&quot;.

      - Jean-Yves Girard has shown that
        this system was inconsistent
        and the preprint was never published.

***** MLTT72

      - was presented in a 1972 preprint
        that has now been published.

        - Per Martin-Löf,
          An intuitionistic theory of types,
          Twenty-five years of constructive type theory
          (Venice,1995),
          Oxford Logic Guides, v. 36, pp. 127--172,
          Oxford Univ. Press, New York, 1998

      - That theory had one universe V and no identity types.
        The universe was &quot;predicative&quot; in the sense that
        the dependent product of a family of objects
        from V over an object that was not in V
        such as, for example, V itself,
        was not assumed to be in V.

      - The universe was a-la Russell,
        i.e., one would write directly &quot;T∈V&quot; and &quot;t∈T&quot;
        (Martin-Löf uses the sign &quot;∈&quot; instead of modern &quot;:&quot;)
        without the additional constructor such as &quot;El&quot;.

***** MLTT73
