docs/source/_posts/person/martin-löf/martin-löf.org
***** MLTT73

      - It was the first definition of a type theory
        that Per Martin-Löf published.

        - Per Martin-Löf,
          An intuitionistic theory of types: predicative part,
          Logic Colloquium '73 (Bristol, 1973), 73--118.
          Studies in Logic and the Foundations of Mathematics,
          Vol. 80, North-Holland, Amsterdam,1975

      - There are identity types which he calls "propositions"
        but since no real distinction
        between propositions and the rest of the types is introduced
        the meaning of this is unclear.

      - There is what later acquires the name of J-eliminator
        but yet without a name (see pp. 94–95).

      - There is in this theory an infinite sequence of universes
        V0, ..., Vn, ...
        The universes are predicative, a-la Russell
        and non-cumulative!
        In fact, Corollary 3.10 on p. 115 says that
        if A ∈ Vm and B ∈ Vn are such that
        A and B are convertible then m = n.
        This means, for example, that
        it would be difficult to formulate univalence in this theory,
        there are contractible types in each of the Vi
        but it is unclear how to declare them to be equal
        since there are no identity types
        connecting Vi and Vj for i≠j.

***** MLTT79

      - It was presented in 1979 and published in 1982.

        - Per Martin-Löf,
          Constructive mathematics and computer programming,
          Logic, methodology and philosophy of science, VI
          (Hannover, 1979), Stud.
          Logic Found. Math., v. 104, pp. 153--175, North-Holland,
          Amsterdam, 1982

      - This is a very important and interesting paper.
        In it Martin-Löf introduced the four basic types of judgement
        for the dependent type theory
        that has since became fundamental
        in the study of the meta-theory of such systems.

      - He also introduced contexts as a separate concept in it
        (see p. 161).
        There are identity types with the J-eliminator
        (which already appeared in MLTT73
        but did not have this name there)
        but also with the rule that makes the theory "extensional"
        (p. 169).
        There are W-types.
        There is an infinite sequence of predicative universes
        that are cumulative.

***** Bibliopolis

      - There is a discussion of a type theory
        in the Bibliopolis book from 1984

        - Per Martin-Löf,
          Intuitionistic type theory, Studies in Proof Theory.
          Lecture Notes, v. 1, Notes by Giovanni Sambin, pp. iv+91, 1984

      - but it is somewhat open-ended
        and does not seem to represent a particular set of choices
        and so there is no specific type theory associated with it.

*** Girard's paradox

    #+begin_src jojo

    #+end_src
